Tekla Open API Reference for Tekla Structures 2025
GridBase Properties
The GridBase type exposes the following members.
Properties
Name | Description
FontColor
 Gets or sets font color for the grid labels
FontSize
 Gets or sets font size for the grid labels
Identifier
 The identifier of the object.
 (Inherited from Object.)
IsMagnetic
 Gets or sets whether the grid is magnetic or not.
IsUpToDate
Gets if the object does not have a modification which is not shared.
 (Inherited from ModelObject.)
ModificationTime
Gets latest time of the object was modified or created.
 (Inherited from ModelObject.)
Name
 Gets or sets the name of the grid.
Origin
 Gets or sets the origin of the grid
Top
See Also
Reference
GridBase Class
Tekla.Structures.Model Namespace